app/Controllers/Api.php

INSERT INTO `dispositivos` (`chip`) VALUES ('08:3A:F2:B8:8E:A4')
---
    public function insertMac($mac)
    {
        echo $mac;
        $dispositivoModel = new Dispositivo();
        $data = ['chip' => $mac];
        $dispositivoModel->insert($data);