app/Controllers/Casa.php

SELECT *
FROM `casa`
WHERE `id_users` = '88'
---
    public function index()
    {
            //session = session();

        $casa = new \App\Models\Casa();
    /*$idUsuario =  $_GET['idUsuario'];
        $casas = $casa->where('id_users', $idUsuario)->findAll();

INSERT INTO `casa` (`id_users`, `nombre`, `id_habitacion`) VALUES ('83', 'leitomarga', '1')
---
    public function habitacion()
    {

        $id_users = $this->request->getPost('idUsuario');
        $nombre = $this->request->getPost('nombre_habitacion');
        $color = $this->request->getPost('color_habitacion');

        $data = array(
            'id_users' => $id_users,
            'nombre' => $nombre,
            'color' => $color
        );

        $casa = new \App\Models\Casa();

        $casa->insert($data);