app/Models/Casa.php

SELECT *
FROM `casa`
WHERE `id_users` = '84'
---
        $builder->select('*');
        $builder->where('id_users', $id);
        $builder->limit(1);
        return $builder->get()->getRow();

SELECT `casa`.*, `habitaciones`.`id_habitacion`
FROM `casa`
JOIN `habitaciones` ON `habitaciones`.`id_casa` = `casa`.`id_casa`
WHERE `casa`.`id_users` = '83'
---
    public function getCasa($id_users)
    {
        $builder = $this->db->table($this->table);
        $builder->select('casa.*, habitaciones.id_habitacion, habitaciones.nombre as nombre_habitacion');
        $builder->join('habitaciones', 'habitaciones.id_casa = casa.id_casa');
        $builder->where('casa.id_users', $id_users);

        $query = $builder->get();